
## Plan Result (ecs_practice/terraform)

[CI link](https://github.com/harayu-k/infra_sandbox/actions/runs/13090409360)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 0 to add, 3 to change, 1 to destroy.</code></pre>

* Update
  * aws_ecs_service.backend
  * aws_iam_policy.backend_ecs_task_execution
  * aws_iam_policy.frontend_ecs_task_execution
* Delete
  * aws_ecr_repository.this[&#34;fluent-bit&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.backend_ecs_task_execution will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "backend_ecs_task_execution" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:GetAuthorizationToken",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:GetDownloadUrlForLayer",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ecr:ap-northeast-1:992382441056:repository/backend",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:ap-northeast-1:992382441056:log-group:/ecs/backend:*",
            ]
        }
    }

  # data.aws_iam_policy_document.frontend_ecs_task_execution will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "frontend_ecs_task_execution" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:GetAuthorizationToken",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:GetDownloadUrlForLayer",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ecr:ap-northeast-1:992382441056:repository/frontend",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:ap-northeast-1:992382441056:log-group:/ecs/frontend:*",
            ]
        }
    }

  # aws_ecr_repository.this["fluent-bit"] will be destroyed
  # (because key ["fluent-bit"] is not in for_each map)
  - resource "aws_ecr_repository" "this" {
      - arn                  = "arn:aws:ecr:ap-northeast-1:992382441056:repository/fluent-bit" -> null
      - force_delete         = true -> null
      - id                   = "fluent-bit" -> null
      - image_tag_mutability = "IMMUTABLE" -> null
      - name                 = "fluent-bit" -> null
      - registry_id          = "992382441056" -> null
      - repository_url       = "992382441056.dkr.ecr.ap-northeast-1.amazonaws.com/fluent-bit" -> null
      - tags                 = {} -> null
      - tags_all             = {
          - "Managed" = "Terraform"
        } -> null

      - encryption_configuration {
          - encryption_type = "AES256" -> null
            # (1 unchanged attribute hidden)
        }

      - image_scanning_configuration {
          - scan_on_push = false -> null
        }
    }

  # aws_ecs_service.backend will be updated in-place
  ~ resource "aws_ecs_service" "backend" {
      ~ desired_count                      = 1 -> 0
        id                                 = "arn:aws:ecs:ap-northeast-1:992382441056:service/backend/backend"
        name                               = "backend"
        tags                               = {}
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_iam_policy.backend_ecs_task_execution will be updated in-place
  ~ resource "aws_iam_policy" "backend_ecs_task_execution" {
        id               = "arn:aws:iam::992382441056:policy/backend-AWSECSTaskExeccutionRole"
        name             = "backend-AWSECSTaskExeccutionRole"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ecr:GetAuthorizationToken"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ap-northeast-1:992382441056:repository/backend"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ap-northeast-1:992382441056:log-group:/ecs/backend:*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.frontend_ecs_task_execution will be updated in-place
  ~ resource "aws_iam_policy" "frontend_ecs_task_execution" {
        id               = "arn:aws:iam::992382441056:policy/frontend-AWSECSTaskExeccutionRole"
        name             = "frontend-AWSECSTaskExeccutionRole"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ecr:GetAuthorizationToken"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ap-northeast-1:992382441056:repository/frontend"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ap-northeast-1:992382441056:log-group:/ecs/frontend:*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":46,"Program":"tfcmt","SHA1":"91e43e823e84ed52ca4f353686530359e99f069a","Target":"ecs_practice/terraform","Vars":{},"WorkflowName":"terraform-plan"} -->